#include <REGX52.H>

void Timer0Init(void)		//1毫秒@12.000MHz
{
	TMOD &= 0xF0;		//设置定时器模式
	TMOD |= 0x01;		//设置定时器模式
	TL0 = 0x18;		//设置定时初值
	TH0 = 0xFC;		//设置定时初值
	
	TF0 = 0;		//清除TF0标志
	TR0 = 1;		//定时器0开始计时
	
	ET0 = 1;    //注意需要加上通道启动的控制
    EA = 1;     // ← 加上这行
}

//void Timer0_Init(){

//	TMOD=TMOD&0xF0; //把TMOD的低四位清零，高四位保持不变
//	TMOD=TMOD|0x01;
//	TF0=0; // 允许计时，使用0定时器模式
//	TR0=1; //每隔1微妙+1
//	
//	TH0=64535/256; //123/100 求出 1
//	TL0=64535%256; //123%100 取余23
//	
//	ET0=1; //通道控制0为断开，1为启动
//	EA=1;  //通道控制
////	PT0=0; //通道控制 导通
//}